{
  "Alliance": "Each FIRST Tech Challenge Match consists of two, two-team Alliances. The two Teams in one Alliance compete against the two Teams in the other Alliance to complete the game challenges and to earn the highest Score. For qualifying and championship tournaments with 21 or more Teams, the semi-final and final Matches Alliances consist of three Teams each. However, only two of those Teams compete during any one Match. \n",
  "Alliance Neutral": "Available to a Robot from any Alliance. \n",
  "Alliance Specific": "Benefits a Robot from a specific Alliance (i.e., red or blue Alliance). Alliance Station",
  "Area": "The space defined by the vertical projection of the outside edge of a region's boundary (for example, gaffer tape, goal, Playing Field Wall). The boundary element (tape, wall, markings, etc.) is part of the Area for the purposes of determining Inside and Outside. \n",
  "Autonomous Period": "A thirty-second Match period in which the Robots operate and react only to sensor inputs and to commands pre-programmed by the Team onto the onboard Robot control system. Human control of the Robot is not permitted during this time. \n",
  "Balanced": "A Shipping Hub is Balanced when it is Completely Supported by the Playing Field Floor and only the Shipping Hub domed base is touching the Playing Field Floor. All other states are Unbalanced. \n",
  "Unbalanced": "A Shipping Hub is Balanced when it is Completely Supported by the Playing Field Floor and only the Shipping Hub domed base is touching the Playing Field Floor. All other states are Unbalanced. \n",
  "Barcode": "The four locations on the Playing Field Floor that consist of three taped squares each, where a Dock or Team Shipping Element is placed during pre-Match setup. \n",
  "Barrier": "Approximate 1-inch high by 5.5-inch wide (25.4 mm x 139.7 mm) obstacle on the Playing Field Barriers do not belong to nor do they form the boundary of any defined Area. \n",
  "Block": "Preventing an opposing Alliance Robot from accessing an Area or Game Element for an extended period by obstructing ALL paths of travel to the object or Area. Active defense played by a Robot shadowing an opposing Alliance Robot that eliminates all paths of travel between the opposing Alliance Robot and an Area or Alliance Specific Game E/emen/or all remaining Alliance Neutral Game Elements is considered Blocking, even though at a given moment there is an open path. See also the definition of Trap\trapping. \n",
  "Blocking": "Preventing an opposing Alliance Robot from accessing an Area or Game Element for an extended period by obstructing ALL paths of travel to the object or Area. Active defense played by a Robot shadowing an opposing Alliance Robot that eliminates all paths of travel between the opposing Alliance Robot and an Area or Alliance Specific Game E/emen/or all remaining Alliance Neutral Game Elements is considered Blocking, even though at a given moment there is an open path. See also the definition of Trap\trapping. \n",
  "Cap": "Placing a Team Shipping Element on top of the Alliance Shipping Hub pipe or on top of another legally Scored Team Shipping Element. \n",
  "Capping": "Placing a Team Shipping Element on top of the Alliance Shipping Hub pipe or on top of another legally Scored Team Shipping Element. \n",
  "Carousel": "The Carousels are located in the corners of the Playing Field adjacent to the Alliance Stations. There are two (2) Carousels, one (1) red and one (1) blue. Carousels are not self-powered and may only be rotated by Robots on the Playlng Fleld in a manner described in Section 4.5. The following are components of the Carousel:\n\ta)  Platform - A rotating portion of the Carousel used to De//yer Docks and Team Shipping Elements into the Playing Field. \n\tb)  Rim - The vertical surface at the perimeter of the Platform where Robot contact is allowed. \n\tc)  Sweeper Plate - The stationary portion of the Carousel that causes the Duck or Team Shipping Element to fall from the Platform and into the Playing Field. \n",
  "Coach": "A student Team member or adult mentor designated as the Drive Team advisor during the Match and identified by wearing a “Coach” badge or identifying marker. \n",
  "Competition Area": "The Area where all the Playing Fields, Alliance Stations, scoring tables, on-deck queuing tables, event officials, and other competition items relating to Match play are located. The Team Pit area and practice Playing Fields are not part of the Competition Area. \n",
  "Control": "An object is Controlled by a Robot if the object is following the movement of the Robot. Objects that are Controlled by a Robot are considered to be a part of the Robot. See also the definition of Possess/Possessing. Examples of interaction with Game Elements that are Controlled include, but are not limited to: \n\ta)  Carrying one or more Game Elements. \n\tb)  Launched Game Elements are considered Controlled until they make contact with something other than the Playing Field Floor or come to rest. See also the definition of Launching in this section. \n\tc)  Herding of Game Elements is considered Control. See also the definition of Herding in this section. \n\td)  Trapping one or more Scoring Elements against a Game Element, Playing Field Wall, or Robot to shield or guard them. See also the definition of Trapping in this section.\nExamples of interaction with Game Elements that are not Controlled include, but are not limited to: \n\te)  Plowing of Game Elements is not considered Control. See also the definition of Plowing in this section. \n\tf)  Inadvertent contact with a Launched Game Element as it bounces off the Playing field or a Robot. See also the definition of Inadvertent in this section. \n",
  "Controlling": "An object is Controlled by a Robot if the object is following the movement of the Robot. Objects that are Controlled by a Robot are considered to be a part of the Robot. See also the definition of Possess/Possessing. Examples of interaction with Game Elements that are Controlled include, but are not limited to: \n\ta)  Carrying one or more Game Elements. \n\tb)  Launched Game Elements are considered Controlled until they make contact with something other than the Playing Field Floor or come to rest. See also the definition of Launching in this section. \n\tc)  Herding of Game Elements is considered Control. See also the definition of Herding in this section. \n\td)  Trapping one or more Scoring Elements against a Game Element, Playing Field Wall, or Robot to shield or guard them. See also the definition of Trapping in this section.\nExamples of interaction with Game Elements that are not Controlled include, but are not limited to: \n\te)  Plowing of Game Elements is not considered Control. See also the definition of Plowing in this section. \n\tf)  Inadvertent contact with a Launched Game Element as it bounces off the Playing field or a Robot. See also the definition of Inadvertent in this section. \n",
  "Deliver": "The action of introducing a Duck or Team Shipping E/emen/onto the Playing Field. A legal Dellvery follows this sequence: \n\ta)  Drive Team places a Duck or Team Shipping Element onto the Carousel Platform Completely In the Drive Team side of the Sweeper Plate. The Duck or Team Shipping Element must be in contact with the Sweeper Plate; then \n\tb)  The Robot must rotate the Carousel Platform; then \n\tc)  The Sweeper Plate must knock the Duck or Team Shipping Element of the Carousel onto the Playing Field Floor. \n",
  "Delivered": "The action of introducing a Duck or Team Shipping E/emen/onto the Playing Field. A legal Dellvery follows this sequence: \n\ta)  Drive Team places a Duck or Team Shipping Element onto the Carousel Platform Completely In the Drive Team side of the Sweeper Plate. The Duck or Team Shipping Element must be in contact with the Sweeper Plate; then \n\tb)  The Robot must rotate the Carousel Platform; then \n\tc)  The Sweeper Plate must knock the Duck or Team Shipping Element of the Carousel onto the Playing Field Floor. \n",
  "Disable": "A Robot that is no longer active for the remainder of the Match due to a Robot failure or by the request of a referee. Only a Referee can declare a Robot Disabled. If a referee Disables a Robot during a Match, they may ask the Team to drive their Robot to a neutral position on the Playing Field, issue a stop command with the Driver Station, and place their DriVer Station in a hands-off location on a competition provided structure or the Alliance Station floor. \n",
  "Disabled": "A Robot that is no longer active for the remainder of the Match due to a Robot failure or by the request of a referee. Only a Referee can declare a Robot Disabled. If a referee Disables a Robot during a Match, they may ask the Team to drive their Robot to a neutral position on the Playing Field, issue a stop command with the Driver Station, and place their DriVer Station in a hands-off location on a competition provided structure or the Alliance Station floor. \n",
  "Disqualified": "A Team that is ineligible to compete in a Match. A Team that is Disqualified from a Match will not receive credit for the Match (that is, no Ranking and no TieBreaker points). \n",
  "Disqualification": "A Team that is ineligible to compete in a Match. A Team that is Disqualified from a Match will not receive credit for the Match (that is, no Ranking and no TieBreaker points). \n",
  "Disqualify": "A Team that is ineligible to compete in a Match. A Team that is Disqualified from a Match will not receive credit for the Match (that is, no Ranking and no TieBreaker points). \n",
  "Drive Team": "Up to three (3) representatives; two (2) Drivers and one (1) Coach from the same Team. \n",
  "Driver": "A pre-college student Team member responsible for operating and controlling the Robot and identified by wearing a competition supplied Driver badge or identifying marker. \n",
  "Driver-Controlled Period": "The two-minute Match time period in which the Drivers operate the Robots. Driver Station",
  "End Game": "The last thirty seconds of the two-minute Driver-Controlled Period. \n",
  "End of the Period": "The moment when the Match timer reaches 2:00 for the Autonomous Period or 0:00 for the Driver-Control Period and which coincides with the start of the sound that designates the End of the Period. \n",
  "End of the Match": "The moment when the Match timer reaches 2:00 for the Autonomous Period or 0:00 for the Driver-Control Period and which coincides with the start of the sound that designates the End of the Period. \n",
  "Freight": "Freight consists of Cargo, Boxes, and Ducks.\n\ta)  Cargo - 2.75 inch (69.9 mm) diameter balls, weight: 1.18 oz. (33.5 grams). Quantity: Twenty (20)\n\tb)  Boxes - 2 inch (50.8 mm) cubes. There are four (4) types of Boxes:\n\t\ti.  Pre-Load - 1.79 oz (50.5 grams). Quantity: Four (4) \n\t\tii.  Light - 1.79 oz (50.5 grams). Quantity: Twenty-Six (26) \n\t\tiii.  Medium - 3.28 oz (93.1 grams). Quantity: Twenty (20) \n\t\tiv. Heavy - 4.78 oz. (135.4 grams). Quantity: Ten (10) \n\tc)  Ducks - 2.125 inches x 2.0 inches x 2.0 inches (54.0 mm x 50.8 mm x 50.8 mm) rubber ducks, weight: 0.56 oz. (15.8 grams). Quantity: Twenty (20) \n",
  "Game Element": "Any item Robots interact with to play the game. Game Elements for this year's game include: Barriers, Shipping Hubs, Carousels, Team Shipping Elements, and Freight. \n",
  "Herding": "Pushing or moving one or more Scoring Elements to a desired location or direction that gains a strategic advantage beyond moving the Robot around the Playing Field. See also the definition of Plowing in this section. \n",
  "In": "An object that has crossed into the upwards vertical (for example, at a right angle to the Playing Field Floor) extension of a defined Area's boundary is Inside the Area. An object that is entirely within the upwards vertical extension of a defined Area's boundary is Completely Inside the Area. The boundary element (tape, wall, markings, etc.) is part of the Area for the purposes of determining Inside and Outside, unless otherwise specified. \n",
  "Inside": "An object that has crossed into the upwards vertical (for example, at a right angle to the Playing Field Floor) extension of a defined Area's boundary is Inside the Area. An object that is entirely within the upwards vertical extension of a defined Area's boundary is Completely Inside the Area. The boundary element (tape, wall, markings, etc.) is part of the Area for the purposes of determining Inside and Outside, unless otherwise specified. \n",
  "Completely In": "An object that has crossed into the upwards vertical (for example, at a right angle to the Playing Field Floor) extension of a defined Area's boundary is Inside the Area. An object that is entirely within the upwards vertical extension of a defined Area's boundary is Completely Inside the Area. The boundary element (tape, wall, markings, etc.) is part of the Area for the purposes of determining Inside and Outside, unless otherwise specified. \n",
  "Completely Inside": "An object that has crossed into the upwards vertical (for example, at a right angle to the Playing Field Floor) extension of a defined Area's boundary is Inside the Area. An object that is entirely within the upwards vertical extension of a defined Area's boundary is Completely Inside the Area. The boundary element (tape, wall, markings, etc.) is part of the Area for the purposes of determining Inside and Outside, unless otherwise specified. \n",
  "Inadvertent": "An unintended side effect of an allowed Robot action. Unforced or unexpected Robot actions based on software commands are not considered to be Inadvedent. \n",
  "Inconsequential": "An outcome that does not influence Scoring or gameplay. \n",
  "Interference": "Interaction between opposing Alliance Robots that amplifies the difficulty of a Scoring activity. Actions that constitute Interference should not be considered illegal except as specified by a game rule. \n",
  "Launching": "Propelling Game Elements with enough force such that they move independent of contact with the Robot. Movement solely due to gravity is not Launching. \n",
  "Loading Dock": "The unmarked Area outside the Playing Field located between the Playing Field Wall and the Alliance Station. \n",
  "Match": "A head-to-head competition between two Alliances. A Match consists of a thirty (30) second Autonomous Period, an eight (8) second transition and a two (2) minute Driver-Controlled Period for a total time of two minutes and thirty-eight seconds (2:38). Navigating",
  "Navigation Image": "Five (5) unique images mounted on the Playing Field Walls that Robots can use to navigate around the Playing Field. Images are printed on standard letter size paper, 8 1/2 inches x 11 inches (216 mm x 279 mm) or A4 (210 mm x 297 mm) paper. Images are mounted on the outside of the Playing Field as described in Appendix F. \n",
  "Off": "Not physically in contact with or Suppoded by an object, surface, etc. Objects that are O/are also considered Completely Off. \n",
  "Completely Off": "Not physically in contact with or Suppoded by an object, surface, etc. Objects that are O/are also considered Completely Off. \n",
  "On": "An object that is physically in contact with and at least partially Supported by an object, surface, etc. is considered On. An object that is entirely Suppoded by an object, surface, etc. is Completely On. \n",
  "Completely On": "An object that is physically in contact with and at least partially Supported by an object, surface, etc. is considered On. An object that is entirely Suppoded by an object, surface, etc. is Completely On. \n",
  "Out": "An object that does not extend into any part of a defined Area is Outside the Area. \n",
  "Outside": "An object that does not extend into any part of a defined Area is Outside the Area. \n",
  "Park": "The condition where a Robot is motionless. \n",
  "Parked": "The condition where a Robot is motionless. \n",
  "Penalty": "The consequence imposed for a rule or procedure violation that is identified by a referee. When a Penalty occurs, points will be deducted from the Score of the Alliance that incurred the Penalty. Penalties are further defined into Minor Penalties and Major Penalties. Penalties may also escalate to the issuing of a Yellow Card or Red Card as a result of a continued occurrence of a rule violation and upon discretion of the Referee. Ye/low Cards and Red Cards",
  "Pin": "Preventing the movement around the Playing Field in directions of an opposing Alliance Robot while it is in contact with the Playing Field Wall, one or more Game Elements, or another Robot. \n",
  "Pinning": "Preventing the movement around the Playing Field in directions of an opposing Alliance Robot while it is in contact with the Playing Field Wall, one or more Game Elements, or another Robot. \n",
  "Playing Field": "The part of the Competition Area that includes the 12 ft. x 12 ft. (3.66 m x 3.66 m) field and all the Game Elements described in the official field documents. From the audience viewpoint, the Red Alliance Station is on the right side of the Playing Field.",
  "Playing Field Damage": "A physical change to a Game Element or Playing Field that affects gameplay.  \n",
  "Playing Field Floor": "The top surface of the Tiles that make up the base of the Playing Field. \n",
  "Playing Field Perimeter": "The outside face of the Playing Fleld Wall. \n",
  "Playing Field Wall": "An approximate 12 inches (30.5 cm) tall, 12 ft. (3.66 m) long by 12 ft. (3.66 m) wide wall surrounding the Playing Field Floor. The height of the Playing Field Wall will vary depending on which Playing Field Wall is being used at the event. Robots should be built to interact with all legal Playing Field Walls. \n",
  "Plowing": "Inadvertent contact with Game Elements while in the path of the Robot moving about the Playing Field that provides no additional advantages beyond field mobility. See also the definition of Herding in this section. \n",
  "Possess": "An object is in Possession by a Robot if, as the Robot moves or changes orientation (for example, moves forward, turns, backs up, spins in place), the object remains in approximately the same position relative to the Robot. Objects in Possession by a Robot are considered to be Controlled, and they are part of the Robot. See also Control/Controlling. \n",
  "Possessing": "An object is in Possession by a Robot if, as the Robot moves or changes orientation (for example, moves forward, turns, backs up, spins in place), the object remains in approximately the same position relative to the Robot. Objects in Possession by a Robot are considered to be Controlled, and they are part of the Robot. See also Control/Controlling. \n",
  "Pre-Load": "A Game Element that a Drive Team positions during pre-hatch setup so that it touches a Robot or is Possessed by a Robot at the start of the Autonomous Period. \n",
  "Queuing Area": "The location in the Competition Area where Drive Teams, Robots, and optional Robot carts are staged until directed by competition personnel to set up their Robots on a Competition Playing Field. \n",
  "Robot": "Any mechanism that has passed Robot inspection and a Drive Team places on the Playing Field prior to the start of a Match. A detailed definition of Robot is in the Robot rules section in the Game Manual Part 1",
  "Score": "Robots earn points for their Alliance by interacting with Scoring Elements and NaVigating to specific Areas of the Playing Field. Scoring Elements that are still in contact with Robots of the corresponding Alliance have zero (0) Score value, unless otherwise specified in Sections 4.5 or 4.6. Scoring determination is done by one of three methods: “Scored Live”, “Scored at End of the Period”, and “Scored at Rest.” The specific method for each Scoring achievement will be stated in the achievement's description in Section 4.5. \n\ta)  Scored Live: The achievement is considered Scored the moment it is successfully completed, i.e., all criteria are met. \n\tb)  Scored at End of the Period: The achievement's Scoring status is determined based on the Robot or Scoring Element's position at the End of the Period. \n\tc)  Scored at Rest: The achievement is considered Scored based on the position of the Robot or Scoring Element when the entire field has come to rest after the Match Period ends. Scoring Elements - Objects that Robots manipulate to earn points for their Alliance. The Scoring Elements for FREIGHT FRENZY are Freight and Team Shipping Elements. \n",
  "Scoring": "Robots earn points for their Alliance by interacting with Scoring Elements and NaVigating to specific Areas of the Playing Field. Scoring Elements that are still in contact with Robots of the corresponding Alliance have zero (0) Score value, unless otherwise specified in Sections 4.5 or 4.6. Scoring determination is done by one of three methods: “Scored Live”, “Scored at End of the Period”, and “Scored at Rest.” The specific method for each Scoring achievement will be stated in the achievement's description in Section 4.5. \n\ta)  Scored Live: The achievement is considered Scored the moment it is successfully completed, i.e., all criteria are met. \n\tb)  Scored at End of the Period: The achievement's Scoring status is determined based on the Robot or Scoring Element's position at the End of the Period. \n\tc)  Scored at Rest: The achievement is considered Scored based on the position of the Robot or Scoring Element when the entire field has come to rest after the Match Period ends. Scoring Elements - Objects that Robots manipulate to earn points for their Alliance. The Scoring Elements for FREIGHT FRENZY are Freight and Team Shipping Elements. \n",
  "Shipping Hubs": "\n\ta)  Alliance Shipping Hub - An Alliance Specific Game Element with three (3) Levels. There are two (2) Alliance Shipping Hubs, one (1) red and one (1) blue. The three (3) Levels are as follows (all dimensions are approximate): \n\t\ti.   Level 1: 18 inches (457 mm) diameter and 3 inches (76.2 mm) above the Playing Field Floor. \n\t\tii.   Level 2: 15 inches (381 mm) diameter and 8.5 inches (215.9 mm) above the Playing Field Floor. \n\t\tiii.   Level 3: 12 inches (305 mm) diameter and 14.75 inches (374.6 mm) above the Playing Field Floor. \n\tb)  Shared Shipping Hub - An approximate 18-inch (45.7 cm) diameter Game Element where Robots from both Alliances place Freight. The Shared Shipping Hub is divided into two semi-circular Alliance Specific Areas. \n",
  "Storage Unit": "An approximate 22.75-inch by 22.75-inch (57.8 cm x 57.8 cm) Alliance Specific Scoring Area where Robots can place Freight. The Storage Unit is located toward the audience side of the Playing Field. \n",
  "Support": "An object (i.e., Robot, Scoring Element, Game Element, etc.) is Suppoded by another object if the second object is bearing at least some of the weight of the first object. If the second object is bearing all the weight of the first object, it is Completely Suppoded by the second object. \n",
  "Supported": "An object (i.e., Robot, Scoring Element, Game Element, etc.) is Suppoded by another object if the second object is bearing at least some of the weight of the first object. If the second object is bearing all the weight of the first object, it is Completely Suppoded by the second object. \n",
  "Spatula": "God",
  "Completely Supported": "An object (i.e., Robot, Scoring Element, Game Element, etc.) is Suppoded by another object if the second object is bearing at least some of the weight of the first object. If the second object is bearing all the weight of the first object, it is Completely Suppoded by the second object. \n",
  "Team": "Mentors, supporters, and pre-college-aged students affiliated with an entity registered with FIRST and for the competition. \n",
  "Team Shipping Element": "The Team Scoring Element for this season. A Team designed and manufactured part that may be used in the Match. A detailed definition of Team Shipping Element is in section 7.4 of the Game Manual Part 1. Compliance with construction rules will be verified during Robot Inspection. \n",
  "Tile": "An approximate 24-inch x 24-inch (610 mm x 610 mm) foam rubber mat. The Playing Field Floor has thirty-six (36) Tiles. \n",
  "Trap": "Preventing an opposing Alliance Robot from escaping a constrained Area of the Playing Field for an extended period of time by obstructing all paths of travel from the object or Area. See also the definition of Block/Blocking in this section. \n",
  "Trapped": "Preventing an opposing Alliance Robot from escaping a constrained Area of the Playing Field for an extended period of time by obstructing all paths of travel from the object or Area. See also the definition of Block/Blocking in this section. \n",
  "Trapping": "Preventing an opposing Alliance Robot from escaping a constrained Area of the Playing Field for an extended period of time by obstructing all paths of travel from the object or Area. See also the definition of Block/Blocking in this section. \n",
  "Warehouse": "An approximate 43.5-inch x 43.5-inch (110.5 cm x 110.5 cm) Area of the Playing Field that is bounded on two sides by white tape and two sides by the Playing Field Wall. There are two (2) Alliance Neutral Warehouses located on the Field. \n",
  "Warehouse Operations": "A Robot must perform the following sequence to remove a piece of Freight from the Warehouse:\na) Start Completely Out of the Warehouse, then\nb) Drive Completely In the Warehouse, then\nc) Collect one (1) piece of Freight, then\nd) Drive Completely Out of the Warehouse with the collected Freight.",
  "Warning": "Warnings apply to the entire Team. Warnings have no effect on an Alliance’s Score. Individual actions of a single Team member will count as a Warning for the entire Team."
}