{
  "<G1>": "Autonomous to Driver-Controlled Period Transition - At the conclusion of the Autonomous Period, Robots will remain in a hands-off state. Field personnel will not enter the field and will not touch Robots on the field during the Autonomous to Driver-Controlled transition. The scoring system display will provide visual and audio cues for Drive Teams to pick up their Driver Stations. Drive Teams will have five (5) seconds to pick up and prepare their Driver Station. After five (5) seconds, there wil be a “3-2-1 go” countdown and the Driver-Controlled Period of the Match will begin. \n",
  "<G2>": "Score Certification at the End of the Match - Scores will be tracked by field personnel throughout the Autonomous and Driver-Controlled Periods of the Match. At the End of the Match, the final Score will be certified as quickly as possible. A change in state of a Game Element or Robot at the End of the Match after its final Score is recorded will not change an already-recorded Score. Scoring Elements will not be recounted after the End of the Match unless otherwise specified by a Game-Specific rule. \n",
  "<G3>": "Forcing an Opponent to Break a Rule - The actions of an Alliance or their Robots shall not cause an opposing Alliance or Robot to break a rule and thus incur Penalties. Any forced rule violations committed by the affected Alliance shall be excused, and no Penalties will be assigned to the affected Alliance. \n",
  "<G4>": "Robot Manipulation of Scoring Elements - Scoring Elements that are Controlled or Possessed by a Robot are part of the Robot except when determining the location of the Robot or otherwise specified by a Game-Specific rule. \nFor Example: If a Robot Possesses a Scoring Element, and only that Scoring Element breaks the plane of a Scoring Area, the Robot does not receive points for being In that Area. \n",
  "<G5>": "Robot or Scoring Elements In Two or More Scoring Areas - Robots or Scoring Elements that are In two or more Scoring Areas earn points only for the highest value achievement. If the achievement values are equal, only one achievement counts as Scored. \n",
  "<G6>": "Scoring Elements in Contact with Robots - Scoring Elements in a Scoring Area that are in contact with or Controlled by a Robot on the corresponding Alliance for the Scoring Area have zero Score value. \n",
  "<G7>": "Disabled Robot Eligibility - If a referee Disables a Robot, it will not be eligible to Score or earn points for the remainder of the Match. A Disabled Robot (whether referee induced or failure) does not earn Penalties after becoming Disabled. \n",
  "<G8>": "Playing Field Tolerances - Competition provided Playing Field and Game Elements will start each Match with tolerances that may vary by as much as +/-1.0 inch (25.4 mm). Teams must design their Robots accordingly. \nPlaying Field and Game Elements are expected to be manufactured, assembled, and set up using a high standard for dimensional and location accuracy. The intent of the generous +/- 1.0 inch tolerance is to accommodate unintentional size and location variations that may occur. The tolerance is not an excuse for intentional or imprecise accuracy in construction or setup. \n",
  "<G9>": "Match Replay - Matches are replayed at the discretion of the Head Referee only for a failure of a non- Team supplied Game or Field Element or verified Wi-Fi interference that was likely to have impacted which Alliance won the Match. \nUnexpected Robot behavior will not result in a Match replay. Team-induced failures, such as low battery conditions, processor sleep time-outs, Robot mechanical, electrical, software, or communication failures, etc. are NOT valid justifications for a replaying of a Match. \n",
  "<G10>": "Inadvertent and Inconsequential - Robot actions that violate a rule may be ruled at the referee’s discretion to be Inconsequential and Inadvertent and will not be Penalized. \n",
  "<G11>": "Illegal Match Communication - Electronic communication (cell phone, two-way radio, Wi-Fi, Bluetooth, etc.) by Drive Team members after an Alliance has been called from the queue to the Playing Field for its Match is not allowed. The first instance of violating this rule will result in a Warning, with any following instances during the competition resulting in a Minor Penalty. Items that may be mistaken by a casual observer as being in violation of this rule should not be brought to the Playing Field. The Driver Station is exempt from this rule but must be used only for operating the Robot. \n",
  "<G12>": "Playing Field Access - Team members must not enter the Playing Field for any reason other than to place/retrieve their Robots. While placing Robots, Teams may not measure, test, or adjust Game Elements unless allowed by Section 4.5.1. When retrieving Robots, Teams may not verify the Scoring of Game Elements. The consequences for violating this rule are: \na) Minor Penalty for violations during Match setup or following the End of the Match. \nb) Major Penalty for violations that delay the start of the Match. \nc) Violations of this rule outside of normal Match play will result in a Yellow Card. \nIf a Team feels the Playing Field is not set up correctly, Teams should notify a referee or field technical advisor prior to the start of the Match. \n",
  "<G13>": "Pre-Match Robot Placement - At the beginning of a Match, each Alliance Robot must be set up on the Playing Field according to section 4.5.1 Pre- Match. After Robots are set up on the Playing Field, Drive Teams must stand Inside their respective Alliance Station. \na) During the Qualification Matches, the blue Alliance Robots are set up on the Playing Field first, unless the red Alliance waives their right to set up on the Playing Field second. \nb) During the Elimination Matches, the 3rd and 4th seeded Alliance Robots are set up on the Playing Field first, unless the higher seeded Alliance waives their right to set up on the Playing Field second. Alliance color doesn’t change the seeding of a Team during the Elimination Matches. If the 4th seed defeats the 1st seed in the Semi-Finals, they will still have to place their Robot on the field first in the finals because their seeding will be lower than the 2nd or 3rd seed. \nc) During Elimination Matches, three Team Alliances may only place two Robots that are intended to compete in that Match. After the Robots are placed, the Alliance cannot swap in the 3rd Al iance’s Robot for a Robot already placed. \nd) Teams may implicitly waive their right to place their Robots on the Playing Field last by placing their Robots on the Playing Field before or with the opposing Alliance. There is no need to tell the referees; Teams waive their right by the act of placing their Robots on the Playing Field. \ne) Teams that unnecessarily delay the beginning of a Match and/or field reset will incur a Minor Penalty for each offense. Significant delays may escalate to a Major Penalty at the discretion of the head referee. \nDrive Teams are expected to stage their Robots for a Match, and remove it from the Playing Field afterwards, safely and swiftly. Drive Team efforts that either intentionally or unintentionally delay the start of a Match or the Playing Field reset are not allowed. Examples include, but are not limited to: \n• Late arrival to the Playing Field. \n• Robot maintenance once on the Playing Field. \nIf the field is waiting for the Team, they would be subject to this Penalty. \n",
  "<G14>": "Robot Starting Volume - Before the start of a Match, each Robot in its starting location must not exceed a volume  of 18 inches (457.2 mm) by 18 inches (457.2 mm) by 18 inches (457.2 mm). A Pre-Loaded Scoring Element may extend Outside the 18-inch (457.2 mm) cube volume constraint. Once a violation has been identified , if the Team cannot fix the violation within thirty (30) seconds, the offending Robot will be removed from the Playing Field. Robots removed from the field are not subject to a delay of game (",
  "<G15>": "Robot Setup Alignment - Teams may align their Robots during Pre- Match setup if they do so with legal components that are part of the Robot and can be reset to be within the 18-inch (457.2 mm) cube starting volume constraint. A single member of the Drive Team may also align the Robot by sight if they are next to the Robot and their action does not delay the start of a Match. A Minor Penalty will be assessed to the Alliance for violation of this rule. \n",
  "<G16>": "Alliance Stations - During a Match, the Drivers and Coaches must remain In their Stations. \na) Drive Teams may be anywhere in their respective Alliance Station. \nb) The first instance of leaving the Station will result in a Warning, with any following instances during the Match resulting in a Minor Penalty. Leaving the Station for safety reasons will not result in a Warning or Penalty \nc) Opposing Al iance’s Drive Team members cannot distract and/or interfere with each other nor the off- field Scoring Elements. Violation of this rule will result in an immediate Major Penalty and a possible Yellow Card. \nThe intent of this rule is to prevent Drive Team members from leaving their assigned Station during a Match to gain a competitive advantage. For example, moving to another part of the Field for better viewing, reaching into the Field, etc. Simply breaking the plane of the Station during normal Match play is not a Penalty. \n",
  "<G17>": "Post -Match Removal of Robots - Robots must be designed to permit easy removal of Game Elements from the Robot after the Match. Robots should also be able to be removed from the Playing Field without unnecessary delay or damaging the Playing Field. A Minor Penalty will be assessed for violations of this rule. \nThe intent of this rule is to have timely removal of Robots from the Playing Field following a Match. Drive Teams are expected to stage their Robots for a Match, and remove them from the Playing Field afterwards, safely, and swiftly. Drive Team efforts that either intentionally or unintentionally delay the start of a Match or the Playing Field reset are not allowed. Examples include, but are not limited to: \n1) Failing to exit the Playing Field once instructed by a referee. \n2) Failing to remove Driver Stations in a timely manner. \n",
  "<G18>": "Starting Gameplay Early - Robots that start playing the game ( Autonomous or Driver-Controlled Period) prior to the start of a Match Period receive a Minor Penalty. Referees have the option of issuing a Major Penalty in place of the Minor Penalty if the early start results in a competitive advantage for the offending Alliance. \n",
  "<G19>": "Late Start of the Autonomous Period - A Drive Team that starts their Robot’s Autonomous Op Mode late will receive a Minor Penalty. Referees have the option of issuing a Major Penalty in place of the Minor Penalty if the late start results in a competitive advantage for the offending Alliance. \n",
  "<G20>": "Robot Actions at End of the Period - \na) Robots must Park at the End of the Autonomous and Driver-Controlled Periods. Robots that are not Parked at the conclusion of the “game sound” receive a Minor Penalty and the actions of the Robot do not count towards their Al iance’s Score. Drive Teams should make their best effort to stop gameplay immediately when the End of the Period game sound begins. Referees have the option of issuing a Major Penalty in place of the Minor Penalty if the late stop results in a competitive advantage (other than Scoring) for the offending Alliance. \nb) Scoring achievements that were started (unless disallowed by Game-Specific rules) before the End of \nc) Robot Scoring achievements that occur after the announced End of the Autonomous Period and before the start of the Driver-Controlled Period do not count towards the Score for the Autonomous or Driver-Controlled Periods. \n",
  "<G21>": "Robot Control During Autonomous Period - During the Autonomous Period, Drive Teams may not directly or indirectly control or interact with Robots or Driver Stations. Early stopping of the Robot while running its Autonomous code is not allowed, except in cases of personal or equipment safety, and any achievements earned due to early stoppage will not Score points. A Major Penalty will be assessed for violating this rule. Teams that stop their Robots during the Autonomous Period are allowed to participate in the Driver-Controlled Period provided it can be done safely. \n",
  "<G22>": "Drive Team Contact with the Playing Field or Robot - During a Match, the Drive Team is prohibited from making contact with the Playing Field, any Robot, or any Game Element unless allowed by Game-Specific rules . The first instance of contact will result in a Warning, with any following instances during the competition resulting in a Minor Penalty. Contact that affects Scoring and/or gameplay will result in issuance of a Yellow Card at the discretion of the referees. Contact with the Playing Field, a Game Element, or a Robot for safety reasons will not result in a Warning or Penalty. \nFor example, a Game Element is Launched from a Robot on the Playing Field and it Inadvertently hits a Team member in the Alliance Station and is deflected back onto the field. The Team would not receive a ",
  "<G23>": "Drive Team Coach Driver Station Control - During the Driver-Controlled Period, Robots must be remotely operated only by the Drivers using the Gamepads connected to the Team’s Driver Station and/or by software running on the on-board Robot control system. The first instance of Coach operating a Gamepad will result in a Warning, with any following instances during the competition resulting in a Major Penalty. During the Driver-Controlled Period, Drive Team Coaches and/or Drivers are allowed to hold the Team’s Driver Station Android device and interact with it to select an Op Mode, view information displayed on the screen, and initialize, start, stop, and reset the Robot. \n",
  "<G24>": "Robots Deliberately Detaching Parts - Robots may not deliberately detach parts during a Match or leave mechanisms on the Playing Field unless permitted by a Game-Specific rule. Possessed or Controlled Scoring Elements are not considered to be a part of the Robot for the purpose of this rule. The consequence of deliberately detaching a part is a Minor Penalty if it does not Block an opposing Alliance Robot, Alliance Specific Scoring Element or Scoring Area. If a deliberately detached component or mechanism affects gameplay by any Robot, the offending Robot will receive a Major Penalty and will be issued a Yellow Card. Robot parts that are released but remain connected by a tether are considered detached for the purposes of this rule. \nTethered components that move independently of the main Robot are considered a detached component and are illegal. \n",
  "<G25>": "Robots Grasping Game Elements - Robots may not grab, grasp and/or attach to any Game Element, Robot, or structure other than Scoring Elements, unless specifically allowed by Game-Specific rule(s) listed in section 4.6.3. The first instance will result in a Warning with any following violations during the competition resulting in a Major Penalty. \n",
  "<G26>": "Destruction, Damage, Tipping, etc. - Robot actions aimed at the destruction, damage, tipping over, or entanglement of Robots or Game Elements are not in the spirit of the FIRST Tech Challenge and are not allowed unless permitted by Game-Specific rules. However, FIRST Tech Challenge games are highly interactive. Robot-to- Robot contact and defensive gameplay should be expected. Some tipping, entanglement, and damage may occur as a part of normal gameplay. If the tipping, entanglement, or damage is ruled to be deliberate or chronic, the offending Team will receive a Major Penalty and a Yellow Card. \n",
  "<G27>": "Removing Game Elements from the Playing Field - Robots may not deliberately remove Game Elements from the Playing Field during a Match. Game Elements that Inadvertently fall Outside the Playing Field will be returned to the Playing Field by field personnel at the earliest safe and convenient opportunity at a non- Scoring location approximately where it left the field. Game Elements removed from the Playing Field in an attempt to Score are also not subject to this Penalty. Teams deliberately removing Game Elements from the Playing Field will incur a Minor Penalty per Game Element removed from the Playing Field. Game-Specific rules listed in section 4.6.3 that address the removal of specified Scoring Elements from the Playing Field take precedence over this general game rule. \n",
  "<G28>": "Pinning, Trapping, or Blocking Robots - A Robot may not cause an opposing Alliance Robot to become Pinned, Trapped, or Blocked. If a referee determines this rule is violated, the offending Alliance will receive a Minor Penalty for every five seconds that they are in violation. If a referee declares a Pinning, Trapping, or Blocking violation during the Match, the offending Robot must immediately move away at least 3 feet (0.9 m), approximately 1.5 Tiles, from the Pinned, Trapped, or Blocked Robot. \nA Robot cannot incur this type of Penalty during the Autonomous Period unless it is determined by the Referee to be part of a deliberate strategy and will be penalized as described above. If the violation happens during the Autonomous Period, the first action done by the offending Robot during the Driver-Controlled Period must be to move away from the Pinned, Trapped, or Blocked Robot or a Minor Penalty will be assessed immediately and again for every five-seconds that they are in violation. Game-Specific rule(s) listed in section 4.6.3 that further define Pinning, Trapping, or Blocking take precedence over this general game rule. \nThe intent of this rule is that Drive Teams begin to immediately move their Robots away and have a five second grace period to move the required distance. The grace period is not permission to intentionally Block for up to five seconds. \n",
  "<GS1>": "General Rule Exceptions - The following instances of gameplay are Game-specific  exceptions  to General Game Rules in section 4.6.2: \na)   Drive Teams may interact with Scoring Elements in the Loadlng Dock at any time during the  Match as an exception to rule <G22>. \nb)   As a part of pre-Match Robot placement or post-Match Robot retrieval, Drive Teams may also place or retrieve their Team Shipping Element as an exception to rule <G12>. \n",
  "<GS2>": "Descoring - Robots may not remove Freight or Team Shipping Elements On or In the opposinq Alliance’s: \na)   Storage Unit Area. Each violation results in a Minor Penalty per Scoring Element. \nb)   Carousel.  Each violation results in a Minor Penalty per Scoring Element. \nc)   Alliance Shipping Hub. Each violation results in a Major Penalty per Scoring Element. \nd)   Section of the Shared Shipping Hub. Each violation results in a Major Penalty per Scoring Element. \nThe intent of this rule is to prevent Robots from removing Scored Freight to the detriment  of the  opposing Alliance. Movement of Scored Freight on the Shared Shipping Hub is to be expected during  normal Scoring activity. As Alliances attempt to Balance the Shared Shipping Hub in their  Alliance's lavor, the expectation  is that some elements may shift as more elements are added to  each side. Intentional removal of Freight from the opposing Alliance’s side of the Shared Shipping  Hub is not allowed. Descoring that affects the Shipping Hub Balance is described in rule ",
  "<GS3>": "Shipping Hub Constraints - The following are constraints placed on the Robots with respect to the Shipping Hubs: \na)   Robots may not intentionally relocate their Alliance Shipping Hub. Inadvertent and  Inconsequential contact is allowed but intentional movement that affects gameplay is assessed a Major Penalty. \nb)   The Shipping Hub Balance shall be determined only by the weight and position of the Shipping  Hub, the Scored Freight, and the Scored Team Shipping Elements. \n\ti.      A Robot contacting its own Alliance Shipping Hub at the End of the Match will result in  that Shipping Hub being considered  Unbalanced. \n\tii .         Robot Interference at any time that affects the final determination of the opposing  Alliance Shipping Hub will result in that Shipping Hub being considered  Balanced. \n\tiii.      A Robot interfering with the Shared Shipping Hub at the End of the Match will result in  the Shared Shipping Hub being considered  Unbalanced in favor of their opponent. If Robots from  both Alliances are interfering, then neither Alliance will get the points for the Shared Shipping  Hub being Unbalanced. \nc)   Robots may not interact with the Shared Shipping Hub during the Autonomous Period. Each  violation of this rule will result in a Minor Penalty. \nd)   Robots may not intentionally relocate or rotate the Shared Shipping Hub. Inadvedent and  Inconsequential contact is allowed but intentional movement that affects gameplay is assessed a  Major Penalty. \ne)   Robots cannot Interfere or interact with the opposing Alliance Shipping Hub or the opposing  Alliance section of the Shared Shipping Hub. Each violation of this rule will result in a Major  Penalty. \n",
  "<GS4>": "Team Shipping Element Constraints - The following are constraints placed on the Robots with  respect to the Team Shipping Elements: \na)   Robots may not intentionally place the Team Shipping Element on the Shared Shipping Hub. Each  violation of this rule results in a Major Penalty. \nb)   Robots may not Interfere with their opposing Alliance’s Capping attempts. While a Robot has a  Possessed Team Shipplng Element In the outside edge of the Shipping Hub, it cannot be Interfered  with. Each violation will result in a Cap being awarded plus a Minor Penalty to the offending  Robot. \nc)   Robots may not Control their opposing Alliance's Team Shipplng Elements. Each violation of  this rule results in a Major Penalty. \n",
  "<GS5>": "Freight Constraints - The following are constraints placed on the Robots with respect to the  Frelght: \na) Freight removed from the Warehouse must follow defined Warehouse Operations. Pre-Loaded Freight is considered to be already removed from the Warehouse. \nb) A Robot must be Completely  Outside of the Warehouse to Score Freight. Each violation of this rule will result in a Minor Penalty. \n",
  "<GS6>": "Launching Scoring Elements - Scoring Elements may not be Launched. Ducks or Team Shipping  Elements falling from the Carousels are exempt from this rule (depending on the circumstances, rule  ",
  "<GS7>": "Carousel Constraints  - Robots may not: \na)   Intentionally place items On the Carousel. Each violation of this rule results in a Mlnor  Penalty. \nb)   Contact the top or bottom surfaces of the Carousel Platform. Robots may only contact the  Carousel Rlm. An immediate Minor Penalty for each violation and an additional Mlnor Penalty for  every 5 seconds of contact will be assessed. \nc)   Contact a Scoring Element On the Carousel. A Minor Penalty is assessed for each violation. \nd)   Interact or Interfere with the opposing Alliance’s Carousel. Violations of this rule will  result in a Major Penalty per occurrence. \ne)   Interact or Interfere with the opposing Alliance’s Robot when it is in contact with the  Carousel. Violations of this rule will result in a Major Penalty per occurrence. \nThe intent of this rule is that Robots only interact with the Carousel at the Rlm, incidental  contact with the top or bottom of the Carousel will not be penalized. \n",
  "<GS8>": "Control/Possession Limits of Scoring Elements  - Robots may Control or Possess a maximum of  one (1) Freight and one (1) Team Shipping Element at a time. \na)   Plowing through any quantity of Scoring Elements is allowed but  /-leading or directing  Scoring Elements above the allowed limit to gain a strategic advantage (for example,  Scorlng,  accessibility, defense) is not allowed. The Penalty for Cosmo/ling or Possessing more than the  allowed quantity is an immediate Minor Penalty for each Scoring Element above the limit plus an  additional Minor Penalty per Scoring Element in excess of the limit for each 5-second interval that  this situation continues. \nb)   A Major Penalty will be assessed for each Scoring Element that is Scored while a Robot  Controls or Possesses more than the allowed quantity. Continued violation of this rule will quickly  escalate to Yellow Cards. \nc)   Freight already Scored in a Robot's own Alllance Scoring Area does not count towards the Control/Possession limit. \nd)   During the Autonomous  Period, Robot contact with their Alliance’s Barcodes (Duck or Team  Shipping Element) that are On the Playing Field Floor is considered Plowing. \n",
  "<GS9>": "Delivery Constraints - The following are constraints placed on the Robots with respect to  DeliVery: \na)   Delivered Ducks and Team Shipping Elements must contact the floor before a Robot may Control  them. Each violation of this rule results in a Minor Penalty. lnadvedent and Inconsequential  contact with the Robot will not be penalized. \nb)   Once the Match begins, Ducks and Team Shipping Elements may only be introduced onto the Playing Field via Delivery. Each violation of this rule results in a Major Penalty. \nc)   DriVe Teams may not place or interact with Ducks or Team Shipping Elements  On the Carousel during the Autonomous Period. Each violation of this rule results in a Major Penalty. \nd)   Ducks or Team Shipping Elements may only be DeliVered onto the Playing Field Floor during the  Autonomous  and End Game Periods of a Match. Each violation of this rule results in a Major  Penalty. \ne)   Only one (1) Dock or Team Shipping Element is allowed On the Carousel at a time. Each  violation of this rule receives a Major Penalty. \nf)    Ducks or Team Shlpping Elements on the Carousel must be in contact with the Sweeper Plate before a Robot can rotate the Carousel. Each violation of this rule results in a Major Penalty. \ng)   Once the Carousel begins to move; the Drive Team can no longer touch a placed Duck or Team  Shipping Element unless it falls off on its own outside of the Field. Each violation of this rule  results in a Major Penalty. Ducks that fall outside the Field will be placed back in the Loading  Dock by the DriVe Team or by Field Personnel if out of reach by the Drive Team. \nh)   Drive Teams may not interact with the Carousel (for example, touching, placing a Duck or Team  Shipping Element) when the Carousel is in motion. Each violation earns a Major Penalty. \ni)    Once a Duck or Team Shlpping Element is Delivered, it is not eligible to be Delivered again. \n",
  "<GS10>": "Autonomous Interference - Robots may not Interfere with the opposing Alliance's Scoring attempts during the Autonomous Period. A Major Penalty will be assessed for each occurrence",
  "<S1>": " Unsafe Robot or Playing Field Damage - If at any time the Robot operation is deemed unsafe or has damaged the Playing Field or another Robot, by the determination of the referees, the offending Robot may be Disabled, and the Team may be issued a Yellow Card. Re-inspection of the Robot is required before it may play another Match. Damage that requires significant repair and/or delays subsequent Match play is likely to escalate to a Red Card.\n",
  "<S2>": " Robot Extension Outside the Playing Field Perimeter - If any portion of the Robot contacts anything Outside the Playing Field Perimeter, the Team will be issued a Yellow Card and it may be Disabled immediately for the remainder of the Match, unless allowed by Game-Specific rule(s) listed in section 4.6.3.\n",
  "<S3>": " Safety Gear - All members of the Drive Team are required to wear approved eye protection and shoes with closed toed and a closed back. If any member of the Drive Team is not wearing these safety items, the referee will issue a Warning to the Team member(s) and if the situation is not remedied within thirty (30) seconds, the offending member(s) of the Drive Team must leave the Competition Area for the remainder of the Match and may not be replaced by another Team member. Failure to comply with a request to leave the Competition Area violates rule <G30>. Repeated Team member violations during the competition will escalate to a Team Warning. Following the Team Warning, subsequent violations by any member of the Team will result in a Minor Penalty for the Alliance.\n"
}